[
    {"text": "I absolutely believe climate change is the most pressing issue of our time. We need drastic action now.", "subreddit": "environment"},
    {"text": "The new tax policy is going to ruin small businesses. It's a terrible move by the government.", "subreddit": "politics"},
    {"text": "Bitcoin is the future of finance. Everyone should be buying the dip right now.", "subreddit": "crypto"},
    {"text": "I'm skeptical of the climate change narratives. The data doesn't add up.", "subreddit": "conspiracy"},
    {"text": "Universal healthcare is a human right. No one should go bankrupt because they get sick.", "subreddit": "politics"},
    {"text": "Electric vehicles are a scam. The batteries are worse for the environment than gas cars.", "subreddit": "cars"},
    {"text": "AI regulation is dangerous. We need to let innovation happen without government interference.", "subreddit": "technology"},
    {"text": "I think the current administration is doing a fantastic job with the economy.", "subreddit": "news"},
    {"text": "Renewable energy is the only way forward. Solar and wind power are cheaper than oil.", "subreddit": "environment"},
    {"text": "Crypto is a bubble that is going to burst. It's all fake money.", "subreddit": "finance"},
    {"text": "We need stricter border control to protect our country.", "subreddit": "politics"},
    {"text": "Space exploration is a waste of money. We should fix Earth first.", "subreddit": "space"},
    {"text": "Elon Musk is a visionary. His work on Mars is inspiring.", "subreddit": "technology"},
    {"text": "Social media is destroying mental health, especially for teenagers.", "subreddit": "society"},
    {"text": "The education system is outdated. We need to teach coding in elementary school.", "subreddit": "education"},
    {"text": "Gun ownership is a fundamental right. We must protect the second amendment.", "subreddit": "politics"},
    {"text": "Recycling is mostly a scam created by plastic companies.", "subreddit": "environment"},
    {"text": "Remote work is the future. Offices are obsolete.", "subreddit": "business"},
    {"text": "Vaccines should be mandatory for public safety.", "subreddit": "health"},
    {"text": "I don't trust the mainstream media. They are biased.", "subreddit": "media"}
]